{
  "gearType": [{
      "gear": "Senior Full-Stack Developer (Fireart Studio | Warszawa, Poland)",
      "gearList": [{
          "item": "Led the successful implementation of NFT minting and staking features across Ethereum, Solana, and Polygon networks, leveraging Solidity and Rust; achieved a 300% increase in token adoption and drove exponential growth in user engagement."
        },
        {
          "item": "Executed and carried out highly scalable React-based NFT marketplaces on Ethereum and Solana networks, leveraging Netlify, Vercel, and AWS, leading to a 60% increase in daily transactions."
        },
        {
          "item": "Managed a team of 4 developers and designers to create efficient, effective, and visually blockchain websites for 60,000+ users with $300,000 of revenue."
        },
        {
          "item": "Transformed Sketch designs into responsive React components using MUI/Tailwind CSS, ensuring seamless user experience across various mobile devices; reduced bounce rate by 15% and increased mobile conversion rate by 20%."
        },
        {
          "item": "Boosted daily traffic from 60% to 80% by redesigning existing websites to improve user experience and incorporating SEO techniques."
        },
        {
          "item": "Developed and launched a customized Shopify store, aligned with the main hotel website; resulting in a 45% increase in online sales and a 20% decrease in cart abandonment rate."
        },
        {
          "item": "Implemented Google Tag Manager and Google Analytics, increasing customer base by 17.6%."
        },
        {
          "item": "Overhauled web service test framework, reducing debugging time by 80%.",
          "type": ["Apr 2021", "Mar 2023"]
        }
      ]
    },
    {
      "gear": "Full-Stack Developer (Espial Group | Ottawa, Canada)",
      "gearList": [{
          "item": "Pioneered the design and deployment of an innovative NFT registration and redemption contract leveraging Solidity; achieved a 28% reduction in transaction time and enabled seamless cross-platform exchanges for users."
        },
        {
          "item": "Deployed highly efficient back-end APIs utilizing Firebase cloud functions, real-time database, and cloud messaging, resulting in a 30% reduction in server response time."
        },
        {
          "item": "Updated and managed an e-commerce platform selling handmade crafts and strengthened online presence, increasing online sales by 130% in 6 months."
        },
        {
          "item": "Grew by 25% the reach of users to the platform, over the installation of the web platform in mobile devices."
        },
        {
          "item": "Worked closely with the designer to design and implement the various UI/UX components for some of the company's largest projects."
        },
        {
          "item": "Updated 100+ React, Angular, and Vue components with Typescript for specific purposes."
        },
        {
          "item": "Realized and carried out a React Native mobile app incorporating geolocation services, a secure payment system, and real-time private and group chat functionality; raised user engagement by 40% and reinforced app downloads by 25%.",
          "type": ["Feb 2019", "Feb 2021"]
        }
      ]
    },
    {
      "gear": "Intern Web Developer (Rewind | Ottawa, Canada)",
      "gearList": [{
          "item": "Utilized HTML5, CSS3, SASS, JavaScript, JQuery, AJAX, Node.js, and Bootstrap extensively for intuitive and flexible web portal designs."
        },
        {
          "item": "Produced visually captivating websites using JavaScript libraries including Angular, React, and Vue, integrating advanced React.js components, Forms, Events, Keys, Router, Redux, Animations, and Flux concepts, leading to enhanced user engagement and intensified conversion rates by 20%."
        },
        {
          "item": "Built a website, with a flexible layout and user-friendly so the number of active users improved by 27.3%."
        },
        {
          "item": "Participated in 3 continuing education training courses to learn modern practices and to learn new coding languages."
        },
        {
          "item": "Wrote code following industry standards and Figma design patterns from 3 projects."
        },
        {
          "item": "Designed a website for a local TV by applying the skill received from the development and full experience as a graphic designer, which resulted in the improvement of the website performance and web traffic by 31%."
        },
        {
          "item": "Suggested 20 improvements to product design and functionality as informed by user experience reporting.",
          "type": ["Dec 2015 ", "Oct 2018"]
        }
      ]
    }
  ]
}