[{
    "title": "NFT Marketplaces Site",
    "description": "Blockasset is an athlete-verified NFT and token ecosystem, enabling fans and athletes to connect like never before, via the power of Web3. Here, I developed Frontend using React/Next and integrated Web3.js into frontend.",
    "technology": "NextJS",
    "image": "../projects/blockasset.png",
    "link": "https://blockasset.co/"
  },
  {
    "title": "Restaurant Site",
    "description": "This is restaurant website using HTML, CSS and Javascript.",
    "technology": "HTML",
    "image": "../projects/restaurant.png",
    "link": "https://github.com/beautylotus/restaurant-landing"
  },
  {
    "title": "React Landing Page",
    "description": "This is advertising website that Blue Sky Energy Technology makes saving energy simple and fun. Here, I developed Frontend using React.",
    "technology": "ReactJS",
    "image": "../projects/react landing.png",
    "link": "https://www.blueskyenergy.co/"
  },
  {
    "title": "Luxury Jewelry Site",
    "description": "Nialaya is a luxury jewelry brand that offers a wide range of high-end bracelets, necklaces, and other accessories. ",
    "technology": "NextJS",
    "image": "../projects/fatLlama.png",
    "link": "https://jidipi.com/"
  },
  {
    "title": "Exit",
    "description": "Keluar sini ye",
    "technology": "Blender",
    "image": "../projects/living.png",
    "link": "https://highlivingconcierge.com/"
  },
  {
    "title": "Blockchain Site",
    "description": "This is Blockchain website. I developed this website using Angualar for Frontend and using Solidity for Backend.",
    "technology": "Angular",
    "image": "../projects/aidog.png",
    "link": "https://aidoge.com/en"
  },
  {
    "title": "Cryptocurrency Exchange Site",
    "description": "Blockfinex is a cryptocurrency exchange that allows users to buy, sell, and trade various digital assets, including Bitcoin, Ethereum, and Litecoin. In this project, I developed frontend using Vue and duilt smart contract using Solidity.",
    "technology": "Vue",
    "image": "../projects/cooperative.png",
    "link": "https://www.blockfinex.com/"
  },
  {
    "title": "Health App",
    "description": "There's a strong correlation between dental health, mental health, and our overall well-being. The founders at Otis partnered with Brash to expand their dental e-commerce company by creating a wellness mobile app to directly help people live better lives, reduce the impact of Bruxism, and improve their oral care and self-care routines. In there, I developed frontend and using React Native,  Redux, Asynchronous Storage, and SCSS",
    "technology": "ReactJS",
    "image": "../projects/Health app.png",
    "link": "https://play.google.com/store/apps/details?id=com.otis.dental"
  },
  {
    "title": "Wizard Site",
    "description": "Praesent ac rhoncus tortor. Proin et interdum libero. Vestibulum ac dui ullamcorper, porta odio sed, ornare quam. Mauris tempor molestie felis non pharetra. Donec nec nisi sit amet libero aliquam varius eu quis erat. Ut varius sagittis urna, non interdum nisl fringilla semper. Morbi tristique sodales eros quis cursus. Pellentesque in euismod lorem. Morbi facilisis nunc eu odio bibendum tempor. Nulla in orci et ante dignissim aliquam non id metus. Integer a vestibulum nunc, at placerat ex. Nam non metus placerat, laoreet ante eu, interdum magna. Nunc lacinia ipsum tortor, at malesuada massa egestas lobortis. Phasellus dictum dui justo, pretium eleifend orci posuere sit amet.",
    "technology": "Blender",
    "image": "../projects/wizard.png",
    "link": "https://wizardmode.io/"
  },
  {
    "title": "Shopify Website",
    "description": "This is the Shopify Website using React. Here, I designed this webstie to be user-friendly, fleixble-layout, and all device responsive design. And implemented payment gateways",
    "technology": "ReactJS",
    "image": "../projects/shopify.png",
    "link": "https://www.carousell.com.hk/"
  },
  {
    "title": "Travel Awal",
    "description": "A travel site",
    "technology": "Vue",
    "image": "../projects/iketo.png",
    "link": "https://www.iketo.diet/"
  }        
]